{"Drepanidae":"This group or family of moths is also known as “hook-tip moths”, this is because the shape of their forewings tips which are usually sickle-shaped or hook-shaped. It is estimated that there are more than 950 species of moth belonging to this family worldwide, however they are predominantly oriental. Within this family there are three assigned subfamilies including Drepaninae, Thyatirinae and Cyclidiinae.<br>The adult moth size varies from small to medium with the length of the wings (wingspan) between 18-66mm. Their antennae are either feathery or thread like (bipectinate to filiform). The proboscis (mouth part) are usually absent or faintly developed. Forewings of this moth are broad and triangular with falcate (hooked) tip while the hind are mostly rounded. Their patterns are mostly shades of brown to yellow but sometimes are colourful or hyaline to white.<br>Adults are usually nocturnal and crepuscular however some are diurnal. They rest with wings ‘roof-like’ over abdomen or with wings spread. The larvae are usually arboreal feeding on leaves during the night time and resting on the rolled leaves during the day time. Many drepanid larvae have the abdomen tapering to a point and they usually rest with the head and tail raised. They make cocoons between leaves but sometimes there are no cocoons or are made inside the soil. Larval host includes a variety of species in the plant families, Anacardiaceae, Betulaceae, Rubiaceae and Caprifoliaceae.","Epicopeiidae":"This family has been placed under superfamily Geometroidea, as it has recently been described using the molecular data. This group or family of moths is also known as Oriental swallowtail moths. They are a small group of moths as there are few known species to fall under this group. There are about 25 species of moths that fall under this group, hence they are rare and hard to find. The species of this family is distributed in the Himalayan and Oriental region however some species have been found in Japan and Korea. It has two subfamilies: Schistomitrinae and Epicopeiinae.<br>The Adults size varies from medium to large (36-126mm wingspan) and they look similar to butterflies due to their wings shape and colouration. Their forewings shape ranges from quadratic to triangular with somewhat pointed apical while hindwings are either rounded or with tails. Their forewings colour varies from dark brown to black with few markings. Sometimes are white with dark or coloured margins. Their hindwings colour may be similar or with coloured marginal spots.<br>The adults are mostly diurnal. There is little known about the larvae however they are leaf feeders and their host plants falls under the plant families Clethraceae, Cornaceae, Ericaceae, Theaceae, Ulmaceae, Hamamelidaceae, etc. The unique feature of the larvae is that they have wax producing gland. The gland produces wax continuously and covers the body of the larvae and later also the pupae.","Zygaenidae":"This group of moths is also known as forester moths, smoky moths or burnet moths. These moths are mostly found in tropical region but some are found also in temperate region. Throughout the world there are about 1000 known species of this family. This family of moths are well studied due to their diurnal habitat, bright and colourful forms and chemical ecology. There are more than 150 known species of this family in India. This family of moth is subdivided into seven subfamilies that are Zygaeninae (burnet moths), Procridinae (forester moths), Chalcosiinae, Charideinae, Phaudinae, Anomoeotinae and Himantopterinae.<br>The adult sizes vary from small to medium. The moths of this family have metallic, bright and colourful wings which vary from narrow to broad in shape and some even have hindwings with tail. They rather have clubbed shaped antennae or are either feathery or thread like. These moths do not have tapering antennae like other families of moth rather the antennae are uniformly thick. This is a unique characteristic of this family. Within this family of moth high sexual dimorphism can be seen for example the male and female are coloured differently like in the species Soritia pulchella. They commonly visit flowers as they usually have well developed proboscis. <br>Adults are usually diurnal and brightly coloured. The bright colour of these moths acts as a warning to the predators that they are poisonous. Hence they are usually avoided by predators like birds. These moths when threatened discharges yellow substance from their necks which are toxic in nature. Both the adults and the larvae of these moths are toxic. The larvae are slug- like with flattened or stout body. The larvae of these moths are host specific and usually feed on angiosperm plant families. The chemical nature of these moths has also added mimicry to their characteristic. These moths lay their eggs in rows, clusters, or overlapping patches and sometimes covered with scales.","Limacodidae":"This family of moths is also known as slug caterpillar moths or hag moths. There are about 1104 known species of this group of moths in the world. This family is distributed throughout the world but diverse in tropics and oriental tropics. The subfamilies are not well established however there are two known subfamilies: Chrysopolominae and Limacodinae.<br>The adult size varies from small to medium (9-80mm wingspan). They have hairy body and legs with broad and rounded wings. The head is small with robust body. The wings colour are mostly shades of grey, however some are colourful wings with few markings. The antennae are thread like, feathery or toothed and often tapering towards the end. The proboscis is small or absent.<br>The larvae also called slug caterpillars feed on various species plants including crops like coffee, tea, banana, oil and coconut plants, etc. hence are also considered to be pests. Other plants include species of Rhamnaceae, Rosaceae, Leguminosae, Euphorbiaceae, etc. Instead of prolegs they have adhesive sucker bands. They are short and slug like with spiny body. The spines on their body when touched are very painful and hence it is also called nettle moths. Adults are mostly nocturnal with irregular and swift flight and while on rest they usually raise their forelegs and abdomen curled upwards. They have oval cocoons that are attached to leaves and barks. When the adult emerge, the cocoons are often left in the shape of a cup and are sometimes called ‘cup moths’.","Saturniidae":"This family of moth is also known as giant silk moths. There are more than 2000 described species of this group in the world. This group of moth is found all over the world however they are diverse in the tropical and subtropical region. Worldwide, there are nine subfamilies designated to this family.<br>The adult size varies from medium to very large (60-140mm wingspan). They have a heavy body covered with hairy scales. Their wings colour is usually shades of brown with the forewings bearing window or eyespots that are triangular or concentric, hence the family name. The hind wings are rounded or with tail and often marked well than the forewings. They have short and feathery, finely branched antennae. Their mouth par is vestigial i.e. without proboscis. <br>The adults are nocturnal but some diurnal like the species of subfamily Hemileucinae. Since the mouth part of the adult is vestigial, they do not feed. They rely on the energy stored during their larval stage. The adults lay eggs in clusters. The eggs have a long incubation period. The larvae have wide range of host plants preferably foliages of woody plants. The larvae are usually solitary. They have tubercles or spines on their body and are usually bright coloured or patterned. The pupae are large and covered with silk often incorporated in leaves or twigs.","Sphingidae":"This family of moth is known as Sphinx moths or Hawk moths and sometimes also bee moths or hummingbird moths. It comprises of about 1602 described species worldwide. In India there are more than 200 species of this family. It is distributes worldwide but has high diversity in the Tropical region of Asia, Africa and America. This family has three subfamilies but mostly two are assigned (Smerinthinae, Sphinginae, and Macroglossinae).<br>The adults are medium to very large sized (40-140mm wingspan). They are heavy bodied moths with narrow forewings and short hindwings. The forewings colour varies from bright to darker shades with different patterns while the hindwings are usually colourful with sometimes having eyespots They have a thread like antennae with sometimes thickened or spindle shaped towards the end. They have large bulging eyes that usually lack hairs. They usually have sucking mouth (proboscis) which rare very long however are short or absent in some species.  The larvae do not have hairs on their body instead a tail like spine is present at the end of their body giving them the name hornworms. <br>Moths of this family have strong wings which help them to fly swiftly. These moths are active during night and dusk but there are some that fly during the day. Many of the moths of this family mimic bumblebees and some even flies like hummingbirds hovering around the flower with which people often get confused. Hence such species are referred to as bee moths and hummingbird hawk moths respectively.  The larvae feed on wide range of plants leaves including economic plants. The larvae when disturbed make noises to scare of predators and sometimes even raise their head like that of the Sphinx of Egypt and so the name, Sphinx moth. The pupae are usually made inside the ground or under leaf litters.","Eupterotidae":"This family of moth is also known as ‘Giant Lappet Moths’ and sometimes ‘Monkey Moths’. It is a small group of moths comprising of about 300 species out of which 40 are known from India. It is distributed throughout the world but is more diverse in the Oriental region. It has six assigned subfamilies.<br>The adult size varies from small-medium to large (24-140mm wingspan). They have robust and hairy body. Antennae are usually feathery and sometimes serrated. Their wings are broader and large and have erratic flight. Their proboscis is absent and rarely vestigial. Their colouration is mostly shades of brown or grey with markings and sometimes white or yellow. The larvae are densely covered with hairs bearing some longer hairs in between. <br>The adults are night flying sometimes to be found in many numbers. They prefer dwelling in forest areas. They have a weak flight. The larvae are leaf feeders whose host plants include that of Boraginaceae, Gramineae, Acanthaceae, Oleacea, etc. They are usually nocturnal and are found to be in clusters and sometimes solitary. They usually pupate in the ground areas including under the leaf litters and sometimes in the cleft of tree barks. The pupae have silk woven cocoons.","Bombycidae":"The moths belonging to this family is also known as silkworm moths. It has more than 300 species of moths throughout the world. It is distributed mostly in Asian and New World Tropics. It includes the well known species, Bombyx mori which produces most of the world’s valuable silk. Its subfamilies include, Bombycinae and Prismostictinae.<br>These are medium sized moths (19–64 mm wingspan). The forewings are broader and triangular in shape with sometimes irregular outer margin or with hooked tips. The hindwings are usually circular in shape. The colouration is usually shades of browns and grays with some markings but sometimes white like that of domesticated silk moth (Bombyx mori). The antennae are usually feathery and sensitive in nature which is used to detect and find their mates even from kilometres away.<br>The adult moths are nocturnal and are usually active to find their mates, breed and lay their eggs. The moths do not have mouth parts and do not feed. They feed during their larval stage and carry enough energy to become adult, breed and lay their eggs. Hence the adult have a very short life span. The larvae are leaf feeders which have a body covered with minute hairs with a small tail like projection at the end. They predominantly feed on the host plants belonging to family Moraceae while other plants include that of Rosaceae and Ebenaceae. They pupate inside the silk cocoons.","Endromidae":"This family of moth is also known as glory moths which are found throughout the Palaearctic regions of the world. There are two assigned subfamilies, Endrominae and Mirininae, within which there are about 30 species of moths included mostly from the former family, Bombycidae. These moths are very rare as they have smaller population.<br>Like Bombycidae the adults are medium sized (29-74mm wingspan). The mouth parts are usually absent or poorly developed. They lack proboscis (vestigial). The body is robust and hairy. The antennae are feathery or thread like. The forewings are broader with pointed tips while the hindwings are rounded. The colouration is dark orange brown with various white spots and darker lines, or lighter spots and lines.  Females are larger than the males and sometimes differ in wings colour and wings shape. <br>The adult females are nocturnal but males are usually diurnal. The larvae are leaf feeders and their host plant families include Betulaceae, Caprifoliaceae, Salicaceae, Tiliaceae, and Ulmaceae. The larvae either have smooth or hairy bodies. The caterpillars usually feed in groups. The pupae are formed inside silk cocoons.","Brahmaeidae":"Also known as Brahmin moth is a small family of moths consisting of about 65 species out of which only two are known from India. It is mostly distributed in the tropical region of the world. This family of moth is assigned with two subfamilies namely, Dactyloceratinae and Brahmaeinae.<br>The adult moths are medium sized to very large sized (50-180mm wingspan). The proboscis is either absent or present. They have large robust body and the antennae are feathery. Their forewings are broadly triangular and rounded at the edges while the hindwings are rounded. The colouration is mostly shades of darker browns with numerous scalloped and concentric light lines and other markings. They are scarcely colourful. <br>The adult moths are nocturnal. The larvae are leaf feeder and most of their host plants are included in the families, Asclepiadaceae and Oleaceae. The larvae have a unique anti-predation behaviour of projecting itself line a snake when touched or disturbed. They pupate in the ground.","Thyrididae":"The moths belonging to this family is also known as picture-winged leaf moths. This family has more than 790 species throughout the world most of which are tropical. It is estimated that there might probably be more than 1200 species of this family. It has four subfamilies, Charideinae,  Siculodinae, Striglininae and Thyridinae.<br>Adults are small to large (9-90mm wingspan). The proboscis is without scales and degenerated. The antennae are either feathery or thread like. The forewings are broad and sometimes curved at the upper margin. The hindwings are rounded. Their wings is often seen to have irregular margins or like dead leaf. The colouration varies as they are darker with lighter spots or shades of brown mimicking dead leaves and sometimes very colourful.<br>Adults are diurnal or crepuscular. They have a distinctive resting position i.e. they perch raising their body upright with their wings outspread. These moths are often hard to find and only few specimens can be seen even in light traps hence it id thought that the population of these moths are scattered or small. These moths are often seen as nectar feeders however there are some tear-sucker moths. The larvae usually conceal themselves while feeding within the leaves or stems. They usually pupate on the ground.","Geometridae":"Moths belonging to this family is also known as geometer moths and larvae of this family are known have variety of names including inchworm, cankerworm, looper or measuring worm. It is one of the largest families of moths consisting of about 23,000 described species worldwide. It is distributed all over the world but is diverse in the Neotropics region. It has nine subfamilies however only six of them are assigned including Oenochrominae, Ennominae, Geometrinae, Larentiinae, Desmobathrinae and Sterrhinae.<br>Adult size varies from small to large (8–120 mm) (average range 20–45 mm). They typically have slender body with broad delicate wings. The forewings are triangular in shape and narrower than the hindwings. These moths usually camouflage themselves to keep away from the predators hence colouration is usually subdued, with browns, greys, whites and rusts predominating or black and white. However there are some brightly coloured ones. The antennae are thread-like, serrate or feathery. They usually have proboscis but there are some whose proboscis is either reduced or absent.<br> The adult moths are usually nocturnal and have cryptic coloured wings but there are some that are diurnal having colourful wings. They feed mostly on nectar but some even on tears or bloods. The larvae also have highly cryptic nature as they are seen mimicking twigs. They usually feed on leaves and are also considered to be defoliators as they cause much harm to crops and economically important plants. They also feed on fruits, dead leaves and stored products and some are even carnivorous, in fact they have a wide range of food preferences. Pupation usually occur without cocoon however some have flimsy cocoon.","Uraniidae":"The moths belonging to this family is also known as swallowtail moths and there are about 700 described species around the world. They are distributed worldwide but mainly diverse in the tropical region. It includes four subfamilies, Auzeinae, Uraniinae, Microniinae and Epipleminae.<br>Adult size varies from medium to large (31-160mm wingspan). They have a slender body. Proboscis is present and naked. Antennae are thread-like, saw-toothed or comb-like and thickened. Forewings are broad and triangular with acute tips while the hindwings are mostly with tail. Colourations are usually shades of dark brown and black with some striae in larger species while the smaller ones are usually white with grey markings. <br>The adults are crepuscular, nocturnal and diurnal. They are known to have butterfly-like features as some of the larger species possess bright colour and are day flying. Some moths are even known for their migratory behaviour. They prefer moist areas. The larvae are leaf feeders and feed on varieties of plants belonging to Caprifoliaceae, Verbenaceae, Rosaceae and Rubiaceae. Pupation usually occurs in leaf litter.","Crambidae":"This family of moths also known as grass moths is one of the large and diverse groups of moths consisting of about 11630 described species worldwide. They are distributed all over the world and there are 17 subfamilies assigned to this family.<br>Adults are small to medium sized (10-35 mm wingspan). Proboscis usually present with scales at their bases. They have thread-like antennae that rest backward in a twisted manner. They have a tubular body with a pair of narrow-triangular forewings and a pair of shorter and broad hindwings. They are often shiny and brightly coloured with different patterns and markings on their wings but sometimes with darker shades of brown and black. <br>The adults are usually crepuscular and nocturnal and only some are diurnal. The larvae are concealed feeders having a wide range of habitat as they are stem borers, root feeders or leaf miners and some of them even live on\/in aquatic vegetation and one group these family lives only in the nests of arboreal ants. They have a variety of host plants including crops and economically important plants and are considered to be pests."}
